app/views/shared/_navbar.html.erb

SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 3]]
---
      <li class="nav-item active">
        <a class="nav-link" href="<%= orders_path %>"><%= image_tag "https://image.flaticon.com/icons/svg/1069/1069102.svg", class: "micarro" %><%= "(#{(current_user).orders.count})" %><span class="sr-only">(current)</span></a>