app/controllers/billings_controller.rb

  def pre_pay

        orders = current_user.orders.where(payed:false)
---
SELECT price * quantity FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."payed" = $2  [["user_id", 1], ["payed", "f"]]